import { bigN } from "./2.1";
// тестирование функции определения наибольшего числа
describe("bigN", () => {
  it("Проверка для чисел a= 3 b = 1. Результат 3", () => {
    expect(bigN(3, 1)).toBe(3);
  });
  it("Проверка для чисел a= 3 b = 3. Результат 3", () => {
    expect(bigN(3, 3)).toBe(3);
  });
  it("Проверка для чисел a= 0 b = -1. Результат 0", () => {
    expect(bigN(0, -1)).toBe(0);
  });
  it("Проверка для чисел a= -3 b = 3. Результат 3", () => {
    expect(bigN(-3, 3)).toBe(3);
  });
});
